In [3]:
import pandas as pd

In [4]:
s1 = pd.Series([1,4,4,3,8,9,0,2,3,4,5,6])
s1

0     1
1     4
2     4
3     3
4     8
5     9
6     0
7     2
8     3
9     4
10    5
11    6
dtype: int64

In [5]:
s1.index

RangeIndex(start=0, stop=12, step=1)

In [6]:
s1 = s1*4
s1

0      4
1     16
2     16
3     12
4     32
5     36
6      0
7      8
8     12
9     16
10    20
11    24
dtype: int64

In [7]:
myfilter = s1 > 15
myfilter

0     False
1      True
2      True
3     False
4      True
5      True
6     False
7     False
8     False
9      True
10     True
11     True
dtype: bool

In [8]:
s1[myfilter]

1     16
2     16
4     32
5     36
9     16
10    20
11    24
dtype: int64

In [9]:

s1[s1>15]

1     16
2     16
4     32
5     36
9     16
10    20
11    24
dtype: int64

In [10]:
s1[s1 > s1.mean()]

4     32
5     36
10    20
11    24
dtype: int64

In [11]:
profile = {'ID': 123, 'Name': 'ashwin', 'Sex': 'Male','Age':34 }
s3 = pd.Series(profile)
s3

ID         123
Name    ashwin
Sex       Male
Age         34
dtype: object

In [12]:
dic1 = { 'Name':['ashwin','rishi','akhil','shiva','jayanth'], 'age':[20,22,19,20,21], 'rating': [7,7,5,5,8]}

In [13]:
df = pd.DataFrame(dic1, index=['a','b','c','d','e'])
df

      Name  age  rating
a   ashwin   20       7
b    rishi   22       7
c    akhil   19       5
d    shiva   20       5
e  jayanth   21       8

In [14]:
df.columns

Index(['Name', 'age', 'rating'], dtype='object')

In [15]:
df['Name']

a     ashwin
b      rishi
c      akhil
d      shiva
e    jayanth
Name: Name, dtype: object

In [16]:
df[:3]

     Name  age  rating
a  ashwin   20       7
b   rishi   22       7
c   akhil   19       5

In [17]:
df['a':'b']

     Name  age  rating
a  ashwin   20       7
b   rishi   22       7

In [18]:
df[['Name','age']]['a':'b']

     Name  age
a  ashwin   20
b   rishi   22

In [19]:
df.age

a    20
b    22
c    19
d    20
e    21
Name: age, dtype: int64

In [20]:
df.loc[:,'Name']

a     ashwin
b      rishi
c      akhil
d      shiva
e    jayanth
Name: Name, dtype: object

In [21]:
df.loc['a':'b','Name':]

     Name  age  rating
a  ashwin   20       7
b   rishi   22       7

In [22]:
df.iloc[1,:]

Name      rishi
age          22
rating        7
Name: b, dtype: object

In [23]:
df.iloc[0:2]

     Name  age  rating
a  ashwin   20       7
b   rishi   22       7

In [24]:
df.iloc[0:2,:]

     Name  age  rating
a  ashwin   20       7
b   rishi   22       7

In [25]:

df

      Name  age  rating
a   ashwin   20       7
b    rishi   22       7
c    akhil   19       5
d    shiva   20       5
e  jayanth   21       8